#pragma once

// DeepRockGalactic SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "FSD_ABP_FesterFlea_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_FesterFlea.ABP_FesterFlea_C
// 0x0BD1 (0x0FD1 - 0x0400)
class UABP_FesterFlea_C : public USpiderAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0400(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_31E004D4490AEFCB3507E2855CE55F0B;      // 0x0408(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DDFF89614AEDA90603058BAE5334B38D;// 0x0428(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C7DAAA0D49A0D7758F7A4B816B897163;// 0x0450(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF23882A4DFD8E225F6B70A279A6D059;// 0x0478(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_355095864DCDDF21995F0ABF03C51B66;// 0x04A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_01CF561B440A4B52619AF0AFF95C41D9;// 0x04C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6FF7E7484B48391EA0395EAF68A917D4;// 0x04F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3ED6BC0447A4EA84C9C7FF8C47FD0AC6;// 0x0518(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5F46BABC4C7C15E802AC7AB083EDB668;// 0x0540(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9435BF6B4CE6DC318422ACBBC250639E;// 0x0568(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E8FCF0224608C874D6BF3EA1D275495C;// 0x0590(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_24347DD745A9D5215EB6959C9144EBBD;// 0x05B8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B0B24C4D4F6BAE1C343F67A7D537DD86;// 0x0630(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C758BBB941CC58BB8F7C88B139138044;// 0x0650(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D92DB9254FB113FB2845028FDF2418BB;// 0x06C8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B923F092444C764C4A641188C261AC37;// 0x06E8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6CC36FBA44A5B2DC1A40AE84E93AE656;// 0x0760(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_59E248F441544AACF120D8A557A595F2;// 0x0780(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_EEBABC1A4B0983B8752DABAF4FE947E6;// 0x07F8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_360BDF2743965E50312173BA543A99D4;// 0x0818(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D07C45E24CAF074AE6836CBC69D69B73;// 0x0890(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B3B4ABA44CFDCF76AE133CA63CDFA6E0;// 0x0930(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_231D7F394E5A37D7DC0739B2D2D1E1A3;// 0x09A8(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B2C27B2846898F8775D8EBBC9DD549FB;// 0x0A20(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E3305BAB4CA554EF0B1282A285EF681C;// 0x0A98(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_276AC8D04494FD284B78FE9942D607CD;// 0x0B10(0x0078)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_E94FE01145BF175119969AAC19E0AF7F;// 0x0B88(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6C89B5334E9CC757156C27A4F76A47A9;// 0x0C38(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FC7E08044D4C80B0A969E1B34E4053AC;// 0x0CB0(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8B21E3184D10952E1C5FAC89B5FDBAD8;// 0x0D28(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F193DB8748693D2054E1A8AC459AF9D5;// 0x0DA0(0x0078)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_48959117463A49B8145A2E955A0C913F;// 0x0E18(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6566BFF741ECC947D95F38AFCB4945E7;// 0x0EB8(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1E2FB5534A1A6B4C0B8E96961EBEE211;// 0x0ED8(0x00B0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_0CF05AB64DA98454F2D166A980007317;      // 0x0F88(0x0048)
	bool                                               Flying;                                                   // 0x0FD0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ABP_FesterFlea.ABP_FesterFlea_C");
		return ptr;
	}


	void SetFlying(bool* NewParam);
	void ExecuteUbergraph_ABP_FesterFlea(int* EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
