#pragma once

// DeepRockGalactic SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "FSD_ABP_TP_Dwarf_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_TP_Dwarf.ABP_TP_Dwarf_C
// 0x4FE0 (0x5560 - 0x0580)
class UABP_TP_Dwarf_C : public UPlayerTPAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0580(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_D1C3D60A443436049FF162BBEB48845D;      // 0x0588(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_41EC773944D4875A0B8080AD0692060D;// 0x05A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_54AC03914929D312684A7AB40ADDD3A9;// 0x05D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9B390A5345C30EDEB6FCF09363288162;// 0x05F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4447E3D647CAF529F70750B55EDCCDF4;// 0x0620(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FB12C11242ECE19F7F9F62A797F56D5C;// 0x0648(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_54404F9441A50012F9C80CAB71BB5663;// 0x0670(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5F8EC4874F79314E97A1078A949933D3;// 0x0698(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_410E884A4DD8165328A51480E66B41EF;// 0x06C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7EB0EC6D4A605D5517A46B94F4DA7FE0;// 0x06E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_53BB2C794E589DC84B6D1CB75A5CB420;// 0x0710(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FFF8D04A437F153ADB98EBAD9DA15F3B;// 0x0738(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_719288E14A030A92C2F38FB9A4B03021;// 0x0760(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D4665C73480BD5092970C8ACAF85CE8E;// 0x0788(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AED3CF1540DFD0684D18689AC3688CAE;// 0x07B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2595A9A74D5B5AAFB6972B840FF96AFE;// 0x07D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8CBB7E4C4EE333095FAA01AF0E1E04D7;// 0x0800(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9E12FAF14AAEDB6933BF6981057847DA;// 0x0828(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_92859DB047A6C21B87F322ADA28D49FB;// 0x0850(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7AE51ED1494BAA787FB26394BBD3FBFA;// 0x0878(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_70864F724F693717E6E84AAE91AD5D17;// 0x08A0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8DBFF32845AB64ADCE5A16B4EC4C7437;// 0x0918(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B7C68CFC46C6C575ABDAADB4A8C8E599;// 0x0938(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1A83FD9245F6B87A9CB48D95F4B4789A;// 0x09B0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_53970147420878D699A89AA21A56CAE9;// 0x09D0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_358B6EB744BAFBB3CC1FFAB10ABCD393;// 0x0A48(0x0020)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_9EA98E214A688667C5EC669193C64A64;// 0x0A68(0x0048)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D47953EB4795FF89C0984BAD9D3025B9;// 0x0AB0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DE17F8D346925DF71481AA8DA2292E2C;// 0x0AD0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_831DD7F1402E7AA40400568FD7C241CE;// 0x0B48(0x0020)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3062A03749A06561741CB980B49AAE2E;// 0x0B68(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C7AB69D049A55E37AC87948B968A17A0;// 0x0C08(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_59CBA8AE460FE9281E45B299CC38AC1E;// 0x0CA8(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0F48FF7B4D6D89CB2DB2608CBDA7C1B9;// 0x0D20(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_833206964AF2DECA80C3C0B78DC45996;// 0x0D98(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3CCC60E446650E10496575A4343CCBE3;// 0x0E10(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EF5C98FA4DF8A56AF8764890CD125CBD;// 0x0EC8(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_99D2751F42FE068FDA32BAB2ED4E2B6C;// 0x0F40(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9BBC7C9F4E1C225CC824DAAECCAEC531;// 0x0FB8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C0325CF6488CBCE6D953099BD705F589;// 0x1058(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_23AE27A44B2C2ECC6FF33FA3A0C76158;// 0x1078(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D76F324E4A821AFBCB218C8A9D338615;// 0x10F0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_710EF992422479E0647ECA8CF24EAEDD;// 0x1110(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A3A6D26749FAABC537EEEB9616D87FC4;// 0x1188(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0244E37E45B2C053C6D06A96E28E20F0;// 0x1228(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9436AD96457998D19560DDA01897647A;// 0x12A0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6D2D70854C9161720E51BFBFEFDDF891;// 0x12C0(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_76E132574AEB7214700F49A70D06CAD2;// 0x1338(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B3F393B2478F619EEF85EFBE4EF0AB6E;// 0x13D8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_BAEF60CF49B6145A0B6A74BEFD620DCC;// 0x1450(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_E538168D40A2FC0B6E13729776226695;// 0x1470(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_F6CBB10A41F1DC62DAF696ABE63E2EF8;// 0x1490(0x0020)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_056E64FA4621FEF21EBCD089FE9D0154;// 0x14B0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4834BB4348D075F1381EEFB36A511CCD;// 0x1550(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E9A698024B9956C3D152D1B3160B1442;// 0x15C8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1E1601AA4AFB29674F7B579269B8E474;// 0x1668(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_566A41FE4EC5F6456B8DC8BCB9926FE9;// 0x1708(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_41725B384DFEDBB08F4A89A56BE1F2E6;// 0x17A8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_721573554739E1DA8E055DAEA7DE2AD7;// 0x1848(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F648352749B2F0E0B2E238B7DE62F66A;// 0x18C0(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E4C8DDFC4D6D37C135A1FDAD7039E825;// 0x1938(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1D5BDF0444F69FD1A4B625BAC7443130;// 0x19D8(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_82AEF1A2416E4BE196956CBA37BC90E0;// 0x1A50(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1987079F4482590F558A94AB016C8060;// 0x1AC8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A95F59B443EB910CC7A0798A458FA280;// 0x1B68(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_468E598144E3FB955715D78C8E168072;// 0x1C08(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F4A501884E2F6FE8D4F38E80D5A678D6;// 0x1C80(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8E5DC76D46FD89C2EBF11A94B4A3C540;// 0x1CF8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6D287BFA4D68ADDA3F0C788CBA22D8F0;// 0x1D98(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8A6707C845C428C66A654895108BCB3E;// 0x1E10(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0744FB5A43F0F61FD611FAB036C89AB4;// 0x1E88(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_84205BE0409998EF217E3499BB074A54;// 0x1F28(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CCCDA4664CEC7A1229094497D1BF07A0;// 0x1FA0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_01953EAF4A9B02FFF84603AAA8B59086;// 0x2040(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1C8DCE134D28FAA90CE7F08E7C6ED720;// 0x20B8(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_579E2A16490CE9F8D1545BBEECB61B66;// 0x2130(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7A29750645EFBA23EA7115B20C5D0CB2;// 0x21D0(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_94255F684B526D82D179B39B89072092;// 0x2248(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7913FCCB42B76997EF0FCABB5F82F941;// 0x22E8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2BF2C0644A023A0EC4E40F82A66942DB;// 0x2388(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E87339F448E7C0396C4B71B4A8E97169;// 0x2400(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4F9C5CE14984C2B2786DE29FDD9E2BAF;// 0x2478(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B4619C0E423B48B77B27EDBC8E05DABC;// 0x2518(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1DEFFAF94F4729FF45E1E3B66CE368CD;// 0x2590(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DAD1B67844B084AC717AAD99EA56475F;// 0x2608(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_21895BFC45016D68260FF991CB3598D5;// 0x26A8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F85030D44C863E3B0488D0BC99CED8A3;// 0x2748(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5AA251EA499002C367348285ACBBA299;// 0x27E8(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CA58F84C47FAA4F8C2BBBC9851C97306;// 0x2860(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6AFDA74C46AE16EFB67885A8AB19EB2A;// 0x28D8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9E365D354288D6D28C7C678270E4581B;// 0x2978(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_18991AB74C4B4E0E93BD4F83BCC58344;// 0x29F0(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D607ADE1440E9E91B67A4BBF793B7153;// 0x2A68(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_50F5FE494AA8D9F9DC87A2B454963017;// 0x2B08(0x00A0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_030E33B341E530605C819DAA8780F05F;      // 0x2BA8(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_AB4A8AA3469D03D23E28859BE9FB1211;// 0x2BF0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C8D9DD5B4D78E170A9CD739AF76D0103;// 0x2C90(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_38D28B2F42766CBF818700A1EFAEDEF3;// 0x2D08(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1D2C7CD74E8088C29B340C8BC2CD3493;// 0x2DC0(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_17851D8947BEA6380FCAE28692A7C8D1;// 0x2EC8(0x0078)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_E9020DF54FA1B02F07F2EEA88055557B;// 0x2F40(0x0048)
	struct FAnimNode_MakeDynamicAdditive               AnimGraphNode_MakeDynamicAdditive_B4B646394083CEE25AB847AE750598BD;// 0x2F88(0x0038)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_87C3A548429BFD8F985F339D1EBEC203;// 0x2FC0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_427EF9FD4961E1B3E732CC8B1777981B;// 0x2FE8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF1E381E41DF66F74FF821BD304FBD78;// 0x3010(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_28334410404703E950E70E8218FC9268;// 0x3038(0x0028)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_9B7A84534C23FF80F10118BBCA3B7272;// 0x3060(0x0048)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4FAF941A4FEBF35D52F8E3815C9EC2CF;// 0x30A8(0x0020)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_C93272D84226B6AF6884289BD3760266;// 0x30C8(0x0048)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_FCDBA9C94BA401B5DB32D9AB93F98A7E;// 0x3110(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E47BD1C241F140538E58D1A608792B39;// 0x3130(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AE3CE951478D94C9622F73B17D39848F;// 0x31A8(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D2A803A7447B65CB5CF4FD93FBF9C455;// 0x31C8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2F76EF8744CE476A8690F4B9166C28E5;// 0x3278(0x0078)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_B4103D0B4743FAA4EFE350B699CAF1C9;// 0x32F0(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6B8F0E364855FD21D9327AB45BA66B10;// 0x3310(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3C036E4E4FC59ED1DD98BCB289DF7670;// 0x3418(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C83D8D964E38FB4006C7B2BDF928108A;// 0x3520(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4287568E455D6C285BB76991F5ABE729;// 0x3540(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_65341335413A786604572B878969EA29;// 0x35B8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BBC0B6EC4991525F17E798A8A0862F48;// 0x3658(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_34098E5F4D73AF452835578971CB8F58;// 0x36D0(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C289D9C14254E5C2E8DCE2ABBFC6838F;// 0x3748(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EDB2BA1B493E748E1CD15EACE52ACA8C;// 0x37E8(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8A89C95C4BBF2459D9F5FC9D35E8FAF4;// 0x3860(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BFBA54F346F649473E30A5BCF0D366E7;// 0x38D8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D5355959479ECAF7F4512BBCA6E50082;// 0x3978(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2BC0EF7B49DE1B1736CF15906DEEA3BB;// 0x39F0(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_740762FA48C11E754031508D46385274;// 0x3A68(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C666D601409CDCBB9C417888E868EB73;// 0x3B08(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0EF2A70746EA0D5C762865B327E0305C;// 0x3B80(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DCCE6636427F977A2C85409D84B25E9F;// 0x3BF8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_73F815CD476E83ABA3CA8AAC8FB477BE;// 0x3C98(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_85A39D6E49CCFE5E078CD790596D1ACF;// 0x3D10(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BFAF124F42B296B4EA67F6A700ECFA14;// 0x3D88(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A90B8024A944CEDB6EC3F91D3A5B10E;// 0x3E28(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E82B08E546EE31866CE59595BAC72764;// 0x3EA0(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7DFA0F39444A81B80D65C2859173F8EE;// 0x3F18(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CAA1E82D41480650648A33B16A279133;// 0x3FB8(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_84196D004AE41F440B91638EFB9B8230;// 0x4030(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C2742A01402C89F2864F119684BBC4FD;// 0x40A8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6B6D07074003A39618FCCBB155528084;// 0x4148(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_AE2E21D24A278E9F502B8B83370E57BB;// 0x41C0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B52E114D4CA7492C4C225FB8A4845316;// 0x4260(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FE3D8EF3433C76992D1765A0149C2768;// 0x42D8(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_297FD9484DCF5B288EC789894B7E5D9E;// 0x4350(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CB97285040F014CAA36DF3B802ADF9DF;// 0x43F0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CFE72D0A4FFED5B343D94D902A8C81E3;// 0x4490(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_91C056664B7AEDD6B3D973A63FB447A9;// 0x4530(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7E5A9315403B2A76B20D97B229A7DD61;// 0x45D0(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_15E50BD6447091EC9247EC9FA4606939;// 0x45F0(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D6C0AF2345790983B1D6E1B90BAE62B7;// 0x46F8(0x0020)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B4FF700C4155DDFA404DB496A65FA7FC;// 0x4718(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_FF6F95D9431F0126E0A2C69C5306A8F9;// 0x47B8(0x00B0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_638FCF59434838C169B919945620E760;// 0x4868(0x00A0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_6769F37F4911A9D560BBB8B38BFB72C8;// 0x4908(0x00A0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_EA67D3E549F59157F497EFA3BBA5F371;// 0x49A8(0x00A0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_709DC0464C23570942AAB4A99DCA8C6D;// 0x4A48(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_08626BA8404623EA94BD69A233FBC28A;// 0x4AE8(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_AE9B52574CB108E35B61828DE56F47D2;// 0x4B08(0x00B0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_CD634A9742BA1089E8548C9022793074;      // 0x4BB8(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_557660394293ABBD70B6B0AC1D14A85C;// 0x4C00(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_78A117EA408DFC76E157129A241EDDAB;// 0x4CA0(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_956308CF4FB69B80A6790A9ECFDC6357;// 0x4D58(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_E624F6B7417EBD8D0AFEECB39B126CA1;// 0x4D80(0x00B8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_92E7791E4BD53EE4B4AC31B1C9FF8CA6;      // 0x4E38(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_E4DAAE9E4469B923CC7885AE7F0940C0;      // 0x4E80(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7E1CD9754B6EE6269E1A71BC02494813;// 0x4EC8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_88FB7C2F4083DA21CA5043826DEA2D3E;// 0x4EF0(0x00B8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_9274EEC44E953197531F68BFB6A20D46;      // 0x4FA8(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_DBB259244484A3C7658D718358594DD2;      // 0x4FF0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C11DC60E442F8008799D1E804CB44453;// 0x5038(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_886D6DF54F6CD2620C2634B8178AFEE2;// 0x5060(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_82B2D71A46EB983C5254FB8953A7DB10;// 0x5100(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_4035569E48431A867F625091664CDA4C;// 0x5128(0x0188)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_AAC2AFCD4F4B8644A74CCE8824928BAD;// 0x52B0(0x0188)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_4A1AF75F4EDDB9D400762EAB99757D58;      // 0x5438(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_ABAF7A084DC30CC866C738BA2E10178A;      // 0x5480(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_742E188F4A995C14505A93A2588F3F66;// 0x54C8(0x0078)
	float                                              StrafeBlendDuration;                                      // 0x5540(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x5544(0x0004) MISSED OFFSET
	class ABP_PlayerCharacter_C*                       BPCharacter;                                              // 0x5548(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	bool                                               LeftFootIKOn;                                             // 0x5550(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x5551(0x0003) MISSED OFFSET
	struct FVector                                     LeftFootIKLocation;                                       // 0x5554(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ABP_TP_Dwarf.ABP_TP_Dwarf_C");
		return ptr;
	}


	void BlueprintInitializeAnimation();
	void AnimNotify_StartBuild();
	void AnimNotify_EndBuild();
	void BlueprintUpdateAnimation(float* DeltaTimeX);
	void AnimNotify_Mine();
	void ExecuteUbergraph_ABP_TP_Dwarf(int* EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
